_protected/views/availability/_form.php

SELECT * FROM `fault_code` WHERE `work_centre_id`=2 ORDER BY `name`
---
                ]); ?>
            </div>
            <div class="col-md-4">
                <?= $form->field($model, 'fault_code_id')->dropDownList(ArrayHelper::map(FaultCode::find()->where(['work_centre_id'=>Yii::$app->user->identity->work_centre_id])->orderBy(['name' => SORT_ASC])->all(), 'id', 'name'), [
                    'prompt'=>' -> Auswählen <- ',
                    'style'=> 'height: 7vh; font-size:2em;',
                    'onchange'=>'
                    $.post("index.php?r=user/index&id='.'"+$(this).val(), function (data) {
                        $("select#fault-code-id").html(data);
                    });'

                ]) ?>