_protected/views/availability/create.php

/* @var $this yii\web\View */
/* @var $model app\models\Availability */

$wc = ArrayHelper::map(WorkCentre::find()->all(), 'id', 'name');
---
SELECT * FROM `work_centre`