_protected/controllers/AvailabilityController.php

SELECT EXISTS(SELECT * FROM `user` WHERE `id`=4)
---
    public function actionCreate()
    {
        $model = new Availability();
        $searchModel = new AvailabilitySearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $dataProvider->query->where('work_centre_id = '.Yii::$app->user->identity->work_centre_id);