_protected/controllers/AvailabilityController.php

INSERT INTO `availability` (`start_time`, `end_time`, `fault_code_id`, `duration_sec`, `work_centre_id`, `created_at`, `created_by`) VALUES (1484125200, 1484125500, 30, 300, 2, 1484131198, 4)
---
    public function actionCreate()
    {

        if (Yii::$app->user->can('availability-create'))
            {


            if ($model->load(Yii::$app->request->post())) {

                //echo '<pre>', var_dump(Yii::$app->request->post());
                //echo '<pre>', var_dump($model->start_time);
                $model->start_time = strtotime(date('Y-m-d', time()).' '.$model->start_time.':00');
                $model->end_time = strtotime(date('Y-m-d', time()).' '.$model->end_time.':00');
                $model->duration_sec = $model->end_time-$model->start_time;


                //echo '<pre>', var_dump($model->start_time);
                $model->work_centre_id = Yii::$app->user->identity->work_centre_id;

                $model->created_at = time();
                $model->created_by = Yii::$app->user->id;

SELECT * FROM `availability` WHERE `id`='30'
---
    protected function findModel($id)
    {
        if (($model = Availability::findOne($id)) !== null) {